x <- c(5, 6.7, T, F, "SHALOPAI")
y <- seq(1, 5, 0.001)
z <- 1.1:11.1

length(z)
names(z)

names(z) <- 1:11

names(z) <- letters[1:11]
z


# Вычисления векторов -----------------------------------------------------

x <- 1:10
y <- -1:-10

x <- T


x + y
x - y
x / y
x * y


x %*% y

is.matrix(t(t(x)))


# Слайсинг ----------------------------------------------------------------

z[c(1, 4, 5)]

z[-c(4, 10)]

z[5:8]

is.numeric(z["e"])
is.double(z["e"])

z < 5

z[z < 5]

z[z < 7 | z > 4]

z[z < 7 & z > 4]
